{"personal_info": {"name": "Amit Badoni", "email": "amitbadoni1699@gmail.com", "phone": "+1 470-301-3942", "location": "Atlanta, USA", "linkedin": null, "github": null, "portfolio": null}, "education": [{"institution": "Georgia Institute of Technology", "location": "Atlanta, USA", "degree": "Master of Science", "field_of_study": "Analytics", "start_date": null, "end_date": "December 2026", "gpa": "4/4", "coursework": []}, {"institution": "Indian Institute of Technology Kanpur", "location": "Kanpur, India", "degree": "B.Tech. & M.Tech. (Dual Degree)", "field_of_study": "Chemical Engineering", "start_date": null, "end_date": "July 2022", "gpa": {"M.Tech.": "10/10", "B.Tech.": "8.5/10"}, "coursework": []}], "work_experience": [{"company": "Smartworks Coworking Spaces", "location": "Gurgaon, India", "role": "Founder's Office Intern – Strategic Initiatives & Innovation", "start_date": "April 2025", "end_date": "June 2025", "bullets": ["Led pilot of CRM AI agent using LLM-based natural language to SQL generation for real-time metrics retrieval", "Led onboarding of AI SaaS tools for design and HR processes, cutting turnaround time by 30% & 80%, respectively", "Built an automated pipeline transforming raw staff attendance data into Power BI monitoring dashboards and REST API triggered WhatsApp alerts to managers, reducing manpower shortage resolution time by 25%."], "skills_used": [], "metrics": [], "experience_context": "India’s largest Proptech enabled office space provider (publicly listed)"}, {"company": "Rocket Learning", "location": "Bangalore, India", "role": "Data Product Manager", "start_date": "March 2024", "end_date": "April 2025", "bullets": ["Built Power BI dashboards using SQL on millions of user-event records to monitor 10+ features; flagged and resolved 50+ issues with developers", "Launched WhatsApp based RAG AI agent to assist education workers; built tracking dashboards in Looker Studio by querying user data from Google BigQuery with SQL, onboarding 3,000+ users with 10% DAU in 2 months.", "Collaborated with data engineers to design ETL pipelines for migration to AWS Redshift using Airflow for orchestration; automated 100+ metrics for A/B testing and reporting using SQL, driving a 15% experiment uplift."], "skills_used": [], "metrics": [], "experience_context": "India’s leading EdTech nonprofit reaching 4M+ children, supported by funders like Gates and Mulago Foundation"}, {"company": "McKinsey & Company", "location": "Mumbai, India", "role": "Business Analyst - 2", "start_date": "September 2022", "end_date": "March 2024", "bullets": ["Reduced coal consumption by 2% for an Energy client by developing a CART model to optimize process parameters", "Supported GenAI impact report with NASSCOM; Consolidated insights from internal pilots and 15+ CxO interviews", "Built $1M EBITDA pipeline for leading auto supplier; Co-ordinated with 15+ stakeholders and delivered 40% value"], "skills_used": [], "metrics": [], "experience_context": ""}], "projects": [{"title": "Interpretable Machine Learning for U.S. Life Expectancy (County-Level Analysis)", "description": "Integrated multi-source public health datasets (CDC, County Health Rankings, Environmental Justice Index) addressing missing data, feature alignment, and multicollinearity to construct a robust modeling dataset. Applied interpretable supervised and unsupervised learning techniques including regularized linear models, tree-based methods, and k-means clustering, achieving MAE ≈ 1.3 years and R² ≈ 0.7 under k-fold cross validation. Productionized model outputs into an interactive GitHub-hosted dashboard highlighting predicted life expectancy and top contributing factors across U.S. counties.", "link": null}, {"title": "Semantic Segmentation using PSPNet with ResNet Backbone", "description": "Implemented a PSPNet-based semantic segmentation model with a ResNet-50 backbone using PyTorch, integrating dilated convolutions, pyramid pooling, and data augmentation, achieving ~56% mean IoU on the CamVid dataset. Improved segmentation performance to ~63–65% mean IoU through fine-tuning of network hyperparameters, learning rate, and regularization parameters, enabling pixel-wise classification across 11 classes on CamVid.", "link": null}, {"title": "Automated Job Application Tracker", "description": "Developed an LLM-powered workflow using LangChain with OAuth2 and Google Sheets API to automate application tracking, including structured extraction, classification, and state updates.", "link": null}], "skills": null, "publications": [], "certifications": [], "application_history": []}